[
    {
        "text": "This Gujjuflavour restaurant has left the best impressions! Hospitable hosts, delicious dishes, beautiful presentation, wide wine list and wonderful dessert. I recommend to everyone! I would like to come back here again and again.",
        "sentiment": "positive"
    },
    {
        "text": " Excellent food. Menu is extensive and seasonal to a particularly high standard. Definitely fine dining. It can be expensive but worth it and they do different deals on different nights so it’s worth checking them out before you book. Highly recommended.",
        "sentiment": "positive"
    },
    {
        "text": " It’s a great experience. The ambiance is very welcoming and charming. Amazing wines, food and service. Staff are extremely knowledgeable and make great recommendations.",
        "sentiment": "positive"
    },
    {
        "text": "This spot gives extraordinary service and yummy meals. One of my favourite restaurants around town. The meals served rapidly and the rates were reasonable. Highly recommended.",
        "sentiment": "positive"
    },
    {
        "text": "The food was a major letdown as well. Not only was it overpriced, but the quality was subpar, leaving much to be desired. Overall, I wouldn't recommend this restaurant to anyone seeking a satisfying dining experience.",
        "sentiment": "negative"
    },
    {
        "text": "The food was underwhelming; it lacked flavor and freshness, making it evident that little care went into its preparation. Combine this with exorbitant prices, and you've got yourself a recipe for a regrettable dining experience.",
        "sentiment": "negative"
    },
    {
        "text": "I recently dined at GujjuFlavour, and while the ambiance was pleasant and the service was prompt, I found the food to be just average. The menu offered a decent variety of Gujarati dishes, but none of them stood out as particularly exceptional. Overall, it was an okay dining experience, but I wouldn't say it was outstanding",
        "sentiment": "positive"
    },
    {
        "text": "The ambience at GujjuFlavour was pleasant, but the food was just average. I expected more authentic flavors from a Gujarati restaurant, but unfortunately, it fell short. The service was decent, and the staff were friendly. Overall, it was an okay experience, but I probably wouldn't rush back anytime soon",
        "sentiment": "positive"
    },
    {
        "text": "The atmosphere at GujjuFlavour was nice, and the service was prompt. However, the food was neither outstanding nor disappointing. It was just average. Overall, it was a decent dining experience without any remarkable highlights",
        "sentiment": "negative"
    },
    {
        "text": "The experience at GujjuFlavour was decent. The food was satisfactory, with some dishes better than others. The service was average, neither exceptional nor poor. The ambience was pleasant, but nothing particularly stood out. Overall, it was a middle-of-the-road dining experience",
        "sentiment": "positive"
    },
    {
        "text": "The meal at GujjuFlavour was alright. Nothing extraordinary, but nothing to complain about either",
        "sentiment": "positive"
    },
    {
        "text": "The food at GujjuFlavour was okay. The service was average, and the atmosphere was nothing special. Overall, it was a decent experience",
        "sentiment": "negative"
    },
    {
        "text": "Good item, but not what I was expecting",
        "sentiment": "positive"
    },
    {
        "text": "The product or service was fine, but it was difficult to use",
        "sentiment": "negative"
    },
    {
        "text": "Okay",
        "sentiment": "positive"
    },
    {
        "text": "The service was okay.",
        "sentiment": "positive"
    },
    {
        "text": "The experience overall was okay.",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "Good item, but not what I was expecting",
        "sentiment": "positive"
    },
    {
        "text": "",
        "sentiment": "neutral"
    },
    {
        "text": "best resturent",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "ok",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "okay",
        "sentiment": "positive"
    },
    {
        "text": "food is good",
        "sentiment": "positive"
    },
    {
        "text": "Gujarati thali is a world best thali for this resturent",
        "sentiment": "positive"
    },
    {
        "text": "",
        "sentiment": "neutral"
    },
    {
        "text": "This Gujjuflavour restaurant has left the best impressions! Hospitable hosts, delicious dishes, beautiful presentation, wide wine list and wonderful dessert. I recommend to everyone! I would like to come back here again and again.",
        "sentiment": "positive"
    },
    {
        "text": "not good for south people",
        "sentiment": "negative"
    },
    {
        "text": "good experience",
        "sentiment": "positive"
    },
    {
        "text": "bad experience",
        "sentiment": "negative"
    },
    {
        "text": "greate resturnet",
        "sentiment": "neutral"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "world best resturent",
        "sentiment": "positive"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "worst resturent",
        "sentiment": "negative"
    },
    {
        "text": "It’s a great experience. The ambiance is very welcoming and charming. Amazing wines, food and service. Staff are extremely knowledgeable and make great recommendations.",
        "sentiment": "positive"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "As a frequent patron of this restaurant, I've noticed a significant decline in the quality of food and service lately. During my last visit, the food was overcooked and lacked flavor, and the presentation was sloppy. Additionally, the staff seemed disorganized and inattentive, taking a long time to take our orders and bring out the food. The ambiance was also lacking, with noisy patrons and an unpleasant smell in the dining area. Overall, I was very disappointed with my experience and will not be returning anytime soon",
        "sentiment": "negative"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "bad",
        "sentiment": "negative"
    },
    {
        "text": "greate",
        "sentiment": "neutral"
    },
    {
        "text": "9",
        "sentiment": "neutral"
    },
    {
        "text": "its ok",
        "sentiment": "positive"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "bad resturent",
        "sentiment": "negative"
    },
    {
        "text": "",
        "sentiment": "neutral"
    },
    {
        "text": "ohh wow what a resturent ",
        "sentiment": "positive"
    },
    {
        "text": "bad",
        "sentiment": "negative"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "bad",
        "sentiment": "negative"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "good",
        "sentiment": "positive"
    },
    {
        "text": "bad",
        "sentiment": "negative"
    },
    {
        "text": "",
        "sentiment": "neutral"
    },
    {
        "text": "worst",
        "sentiment": "negative"
    },
    {
        "text": "Absolutely loved the authentic Gujarati flavors at this restaurant! The dhoklas were soft and fluffy, and the undhiyu had just the right balance of spices. The service was excellent too. Will definitely be coming back for more!",
        "sentiment": "positive"
    },
    {
        "text": "Absolutely loved the authentic Gujarati flavors at this restaurant! The dhoklas were soft and fluffy, and the undhiyu had just the right balance of spices. The service was excellent too. Will definitely be coming back for more!",
        "sentiment": "positive"
    },
    {
        "text": "My visit to Gujju Flavour was delightful! From the warm welcome to the authentic ambiance, everything was perfect. The Dhokla and Khandvi were delicious starters, and the Thali was a journey through the best of Gujarati cuisine, ending with the sweet perfection of jalebi and shrikhand. Highly recommend for a taste of true Gujarati hospitality and flavors!",
        "sentiment": "positive"
    },
    {
        "text": "Unfortunately, my experience at Gujju Flavour fell short of expectations. While the ambiance was decent, the service was slow, and the food lacked the authentic Gujarati flavor I was hoping for. The Dhokla was a bit too dense, and the Thali, although varied, didn't live up to its promise, with some dishes being overly salty. It was a letdown, especially given the high hopes I had for a genuine Gujarati dining experience.",
        "sentiment": "positive"
    },
    {
        "text": "Visited Gujju Flavour with high hopes for an authentic Gujarati meal, but was left disappointed. The ambiance felt uninviting, service was slow, and the food missed authenticity. The Dhokla was dense, and the Thali lacked flavor balance, with some dishes being too salty. Sadly, it didn’t live up to the expectations set by its name.",
        "sentiment": "negative"
    },
    {
        "text": "Visited Gujju Flavour with high hopes for an authentic Gujarati meal, but was left disappointed. The ambiance felt uninviting, service was slow, and the food missed authenticity. The Dhokla was dense, and the Thali lacked flavor balance, with some dishes being too salty. Sadly, it didn’t live up to the expectations set by its name.",
        "sentiment": "negative"
    }
]